using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _02计算机的发展
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            计算机系统=硬件+软件
            硬件:计算机的实体部分:主机,外设
            软件:操作系统,app,由具有各类特殊功能的程序组成
            计算机性能的好坏取决于"软","硬"件功能的总和
            
            软件:
                1)系统软件:用来管理整个计算机系统--操作系统,数据库管理系统(DBMS),标准程序库,网络软件(管理网络协议),
                            语言处理程序(比如编译成机器语言),服务程序(比如调试程序)
                2)应用软件:按任务需要编制成的各种程序
            
            硬件的发展
                第一台电子计算机:ENIAC(1946)
                    逻辑元件(用来处理电信号的最小的基本单元):电子管(1.8w个)
                    第一代:电子管时代:体积超大,耗电量超大,使用机器语言编程 纸袋机 bug
                晶体管:贝尔实验室
                    逻辑元件:晶体管
                    第二代:晶体管时代:体积,功耗降低,出现了面向过程的程序设计语言:FORTRAN,有了操作系统的雏形
                集成电路:
                    第三代:中小规模集成电路时代:把元件集成在基片上,计算机主要用于科学计算等专业用途,高级语言迅速发展,
                            开始有了分时操作系统
                大规模集成电路:
                    第四代:大规模,超大规模集成电路时代:开始出现"微处理器"(cpu),微型计算机,个人计算机(pc)萌芽
                            操作系统:Windows,MacOS,Linux
                            微型计算机的发展以微处理器技术为标志

            1947,贝尔实验室,发明了"晶体管",晶体管之父:威廉 肖克利
            1955,肖克利在硅谷创建 肖克利实验室股份有限公司
            1957,八叛徒创立仙童半导体公司
            1959,仙童半导体公司发明集成电路
            1968,摩尔等人离开仙童,创立Intel
            1969,仙童销售部负责人桑德斯离开仙童,创立AMD

            摩尔定律:揭示了信息技术进步的速度,集成电路上可容纳的晶体管数目,约每隔18个月便会增长一倍,整体性能也将提升一倍
            半导体存储器的发展
            1970年,仙童公司生产出第一个较大容量的半导体存储器
                    

            软件的发展
                机器语言-->汇编语言-->PASCAL c++-->java python
                系统软件:DOS Windows Android ios
                计算机系统两级分化
                    一极是微型计算机向更微型化,网络化,高性能,多用途方向发展
                    一极是巨型机向更巨型化,超高速,并行处理,智能化方向发展
            */
        }
    }
}
